// lessons/lesson1.js
export const lesson = {
  id: 3,
  title: "ИИ не знает. Он угадывает",
  subtitle: "Почему ИИ может уверенно нести ерунду",

  scenes: [
    // 1
    {
      id: "1",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_%D0%A1%D0%A6%D0%95%D0%9D%D0%90%201..png?raw=true",

      author: [
        "🎬 СЦЕНА 1. Кирилл уже почти профи 😏",
        "Кирилл идёт по планете ИИ вместе с роботом.",
        "Вокруг — таблички «Данные», «Ответы», «Прогнозы».",
      ],

      dialog: [
        {
          type: "story",
          speaker: "Кирилл",
          text: [
            "— Окей, я понял.",
            "— Нужно просто нормально объяснять.",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Да.", "— Но есть ещё одна проблема."],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: ["— Какая ещё?"],
        },
      ],
    },
    // 2
    {
      id: "2",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_scena2.png?raw=true",

      author: ["🎮 СЦЕНА 2. ИИ СЛИШКОМ УВЕРЕН"],

      dialog: [
        {
          type: "autor",
          speaker: "",
          text: ["Робот открывает терминал."]
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— Ты же ИИ!",
            "— Ты должен ЗНАТЬ!",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Я не знаю.",
            "— Я угадываю самый вероятный ответ.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— …",
            "— А выглядело, как будто ты уверен на 100%.",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ  робот",
          text: [
            "— У меня нет чувства «уверен».",
          ],
        },
      ],
    },
    // 3
    {
      id: "3",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_scena2.png?raw=true",

      author: ["🎮 СЦЕНА 2. ИИ СЛИШКОМ УВЕРЕН"],

      dialog: [
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— Ты же ИИ!",
            "— Ты должен ЗНАТЬ!",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Я не знаю.",
            "— Я угадываю самый вероятный ответ.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— …",
            "— А выглядело, как будто ты уверен на 100%.",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ  робот",
          text: [
            "— У меня нет чувства «уверен».",
          ],
        },
      ],
    },

    // mysli 1
    {
      id: "thought",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_mysliKyryla.png?raw=true",

      author: ["💭 МЫСЛИ КИРИЛЛА"],
      dialog: [
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: ["«Он ответил быстро и спокойно.", "Как будто правда."],
        },
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "Если бы я не знал Майнкрафт,",
            "я бы поверил.",
          ],
        },
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "Значит…",
            "он может говорить уверенно",
            "и всё равно ошибаться.»",
          ],
        },
        {
          type: "author",
          text: ["Кирилл хмурится."],
        },
      ],
    },

    // 4
    {
      id: "4",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_scena4.png?raw=true",

      author: ["🧠 СЦЕНА 4. ВАЖНОЕ ОТКРЫТИЕ"],
      dialog: [
        {
          type: "story",
          speaker: "Кирилл",
          text: [
            "— Подожди…",
            "— Ты понимаешь только то, что можно представить как правила?",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Да.",
            "— Чем больше правил — тем лучше результат.",
            "— Чем больше конкретных слов, тем лучше",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— А если правил мало?"],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Тогда я угадываю."],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— А угадываешь ты… так себе 😅"],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Согласен."],
        },
      ],
    },
    // МИНИ-ЗАДАНИЕ
    {
      id: "task",
      image: "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_task.png?raw=true",
      author: ["🎮 МИНИ-ЗАДАНИЕ"],

      dialog: [
        {
          type: "task",
          question: "Почему ИИ не понял задание «крутой квест»?",
          options: [
            "потому что он ленивый",
            "потому что он тупой",
            "потому что задание слишком общее ",
          ],
          correct: 2,
          discussion: {
            title: "🧠 Обсуждение",
            points: [
              "Какие слова здесь «пустые»?",
              "Что именно значит «крутой»?",
              "Что в задании осталось непонятным для ИИ?",
            ],
          },
        },
      ],
    },
    // 5
    {
      id: "5",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_scena5.png?raw=true",

      author: ["🎬 СЦЕНА 5. Кирилл учится объяснять"],
      dialog: [
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— Окей.", "— Тогда слушай внимательно."],
        },
        {
          type: "story",
          speaker: "Кирилл (медленно)",
          text: [
            "— Придумай квест для игры.",
            "— Он должен быть сложным.",
            "— Там должен быть босс.",
            "— Должны быть ловушки.",
            "— И в конце — крутая награда.",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Принято."],
        },
        {
          type: "author",
          text: ["Появляется новый квест."],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Квест:",
            "Игрок проходит лабиринт с ловушками,",
            "сражается с боссом",
            "и получает редкий артефакт.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— О.", "— О-О!", "— Вот это уже похоже на игру."],
        },
      ],
    },
    // mysli2
    {
      id: "thought",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_mysliKyryla.png?raw=true",

      author: ["💭 МЫСЛИ КИРИЛЛА (ключевой момент)"],
      dialog: [
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "«Я ничего магического не сделал.",
            "Я просто объяснил нормально.",
          ],
        },
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: ["Типа как другу,", "который не в теме.»"],
        },
      ],
    },
// правило
    {
      id: "rule",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_%20prawilo.png?raw=true",

      author: ["🎯 СЦЕНА 6. ПРАВИЛО ПЛАНЕТЫ ИИ"],

      dialog: [
        {
          type: "rule",
          title: "❗ ПРАВИЛО ПЛАНЕТЫ ИИ",
          rule: "Чем точнее задание — тем лучше результат",
          dialog: [
            {
              speaker: "Робот",
              text: "— Это главное правило нашей планеты.",
            },
            {
              speaker: "Кирилл",
              text: [
                "— Запомнил.",
                "— И вообще…",
                "— Это полезно не только для ИИ.",
              ],
            },
          ],
        },
      ],
    },
// МИНИ-ЗАДАНИЕ
    {
      id: "task",
      image: "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_zadanie2.png?raw=true",
      author: ["🎮 МИНИ-ЗАДАНИЕ"],

      dialog: [
        {
          type: "task",
          question: "Сравни задания и выбери нужное",
          options: [
            "Придумай персонажа",
            "Придумай персонажа для игры: злой маг, живёт в башне, использует молнии",
          ],
          correct: 1,
          discussion: {
            title: "🧠 Обсуждение",
            points: [
              "какое задание понятнее?",
              "почему?",
            ],
          },
        },
      ],
    },
    // 6
    {
      id: "6",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_%D0%A1%D0%A6%D0%95%D0%9D%D0%90%201..png?raw=true",

      author: ["🏁 ФИНАЛ УРОКА"],
      dialog: [
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Ты начал понимать, как с нами разговаривать."],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— Ага.", "— Вы не тупые.", "— Вам просто нужны нормальные инструкции."],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Верно.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— Ладно.", "— Пошли дальше.", "— Мне кажется, я могу вас прокачать 😎"],
        },
      ],
    },
    // final
    {
      id: "final",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module2/module2_final.png?raw=true",

      author: ["🧩 ВЫВОД УРОКА"],

      dialog: [
        {
          type: "author",
          text: [
            "ИИ понимает <b>буквальн</b>о",
                      ],
        },
        {
          type: "author",
          text: ["слова типа «круто», «нормально», «как обычно» — плохие инструкции",
            ]
        },
        {
          type: "author",
          text: [
            "чем больше деталей, тем лучше результат",
            "ИИ угадывает, если задание плохое",
          ],
        },
      ],
    },
  ],
};
