// lessons/lesson1.js
export const lesson = {
  id: 4,
  title: "Как не вестись на ответы ИИ",
  subtitle: "Проверяем и перепроверяем",

  scenes: [
    // 1
    {
      id: "1",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_scena1.png?raw=true",

      author: [
        "🎬 СЦЕНА 1. Кирилл уже почти профи 😏",
        "Кирилл идёт по планете ИИ вместе с роботом.",
        "Вокруг — таблички «Данные», «Ответы», «Прогнозы».",
      ],

      dialog: [
        {
          type: "story",
          speaker: "Кирилл",
          text: [
            "— Окей, я понял.",
            "— Нужно просто нормально объяснять.",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Да.", "— Но есть ещё одна проблема."],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: ["— Какая ещё?"],
        },
      ],
    },
    // 2
    {
      id: "2",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_scena2.png?raw=true",

      author: ["🎮 СЦЕНА 2. ИИ СЛИШКОМ УВЕРЕН"],

      dialog: [
        {
          type: "autor",
          speaker: "",
          text: ["Робот открывает терминал."]
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Спроси меня что угодно.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— Легко.",
            "— Скажи, кто самый сильный моб в Майнкрафте?",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ  робот",
          text: [
            "— Самый сильный моб — курица.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— ЧЕГО 😐",
            "— Ты прикалываешься?! Шутишь??",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ  робот",
          text: [
            "— Нет.",
            "— Я уверен.",
            "— Я не умею шутить.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— Да курица умирает с одного удара!",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ  робот",
          text: [
            "— Вероятно.",
            "— Но я дал ответ.",
          ],
        },
      ],
    },
    // 3
    {
      id: "3",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_scena3.png?raw=true",

      author: ["😡 СЦЕНА 3. Кирилл снова злится"],

      dialog: [
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— Ты же ИИ!",
            "— Ты должен ЗНАТЬ!",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Я не знаю.",
            "— Я угадываю самый вероятный ответ.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл (уверенно):",
          text: [
            "— …",
            "— А выглядело, как будто ты уверен на 100%.",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ  робот",
          text: [
            "— У меня нет чувства «уверен».",
          ],
        },
      ],
    },

    // mysli 1
    {
      id: "thought",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_mysli1.png?raw=true",

      author: ["💭 МЫСЛИ КИРИЛЛА"],
      dialog: [
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: ["«Он ответил быстро и спокойно.", "Как будто правда."],
        },
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "Если бы я не знал Майнкрафт,",
            "я бы поверил.",
          ],
        },
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "Значит…",
            "он может говорить уверенно",
            "и всё равно ошибаться.»",
          ],
        },
        {
          type: "author",
          text: ["Кирилл хмурится."],
        },
      ],
    },

    // 4
    {
      id: "4",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_scena4.png?raw=true",

      author: ["🧠 СЦЕНА 4. ПРОВЕРКА ИИ"],
      dialog: [
        {
          type: "story",
          speaker: "Кирилл",
          text: [
            "— Окей, проверим",
            "— Сколько будет 7 × 8?",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— 56.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— А кто победит: крипер или курица?"],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Вероятно, крипер."],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["—— А почему тогда курица была «самой сильной»?"],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Мой предыдущий ответ был ошибочным."],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: [
            "— Вот!", 
            "- Ты не знаешь.",
            "— Ты просто угадываешь.",
          ],
        },
      ],
    },
    // МИНИ-ЗАДАНИЕ
    {
      id: "task1",
      image: "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_task1.png?raw=true",
      author: ["🎮 МИНИ-ЗАДАНИЕ"],

      dialog: [
        {
          type: "task",
          question: "Почему ИИ может ошибаться?",
          options: [
            "потому что он шутит",
            "потому что он угадывает по примерам ",
            "потому что он устал",
          ],
          correct: 1,
          discussion: {
            title: "🧠 Обсуждение",
            points: [
              "как понять, что ответ странный?",
              "когда нужно проверять?",
            ],
          },
        },
      ],
    },
    // 5
    {
      id: "5",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_scena5.png?raw=true",

      author: ["🎬 СЦЕНА 5. ОПАСНЫЙ МОМЕНТ"],
      dialog: [
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— А если тебя спросить что-то важное?"],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Я всё равно отвечу."],
        },
        {
          type: "story",
          speaker: "Кирилл (медленно)",
          text: [
            "— Даже если не уверен?",
          ],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: ["— Да."],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— Вот это стрёмно."],
        },
      ],
    },
    // mysli2
    {
      id: "thought",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_mysli2.png?raw=true",

      author: ["💭 МЫСЛИ КИРИЛЛА (ключевой момент)"],
      dialog: [
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "«Значит, ИИ — это не учитель.",
          ],
        },
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "Это как чел в чате,", 
            "который быстро отвечает",
            "но может нести фигню.",
          ],
        },
        {
          type: "thought",
          speaker: "💭 Мысли Кирилла:",
          text: [
            "Если не проверять — можно влететь.»",
          ],
        },
      ],
    },
// правило
    {
      id: "rule",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_scena6.png?raw=true",

      author: ["🧠 СЦЕНА 6. ПРАВИЛО №2 ПЛАНЕТЫ ИИ"],

      dialog: [
        {
          type: "rule",
          title: "❗ ПРАВИЛО ПЛАНЕТЫ ИИ №2",
          rule: "ИИ отвечает уверенно, даже когда ошибается",
          dialog: [
            {
              speaker: "Робот",
              text: "—— Поэтому человеку нужно думать.",
            },
            {
              speaker: "Кирилл",
              text: [
                "— Короче.",
                "— Если ответ странный — проверяй.",
              ],
            },
            {
              speaker: "Робот",
              text: "— Верно.",
            },
          ],
        },
      ],
    },
// МИНИ-ЗАДАНИЕ
    {
      id: "task2",
      image: "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_task2.png?raw=true",
      author: ["🎮 МИНИ-ЗАДАНИЕ 2"],

      dialog: [
        {
          type: "task",
          question: "Какие ответы ИИ нужно проверять в первую очередь?",
          options: [
            "факты",
            "домашку",
            "советы",
            "всё вышеперечисленное ",
          ],
          correct: 3,
          discussion: {
            title: "🧠 Обсуждение",
            points: [
              "какое задание понятнее?",
              "почему?",
            ],
          },
        },
      ],
    },
    // 6
    {
      id: "6",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_final1.png?raw=true",

      author: ["🏁 ФИНАЛ УРОКА"],
      dialog: [
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— Знаешь что?", "— Ты полезный, но опасный."],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Это точное описание.",
          ],
        },
        {
          type: "story",
          speaker: "Кирилл",
          text: ["— Ладно.", "— Я буду использовать тебя с умом."],
        },
        {
          type: "ai",
          speaker: "ИИ робот",
          text: [
            "— Хороший план.",
          ],
        },
      ],
    },
    // final
    {
      id: "final",
      image:
        "https://github.com/ksushatarasenko/curseAI-course-assets/blob/main/module3/module3_final2.png?raw=true",

      author: ["🧩 ВЫВОД УРОКА"],

      dialog: [
        {
          type: "author",
          text: [
            "ИИ не знает, а угадывает",
                      ],
        },
        {
          type: "author",
          text: ["ИИ может ошибаться, даже если звучит уверенно",
            ]
        },
        {
          type: "author",
          text: [
            "не всё, что говорит ИИ — правда",
            "ответственность всегда на человеке",
          ],
        },
      ],
    },
  ],
};
